# DataFrames: Selecci贸n de datos con una condici贸n

In [1]:
#importa numpy y pandas
import numpy as np
import pandas as pd

In [2]:
filas = 'ventas1 ventas2 ventas3'.split()
filas

['ventas1', 'ventas2', 'ventas3']

In [3]:
columnas = 'zonaA zonaB zonaC'.split()
columnas

['zonaA', 'zonaB', 'zonaC']

In [4]:
datos = [[120,340,250],[210,450,250],[310,210,140]]

In [5]:
dataframe = pd.DataFrame(datos,filas,columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [8]:
#condici贸n
condicion = dataframe > 200

In [9]:
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    NaN    340  250.0
ventas2  210.0    450  250.0
ventas3  310.0    210    NaN

In [10]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [11]:
condicion_columna = dataframe['zonaA']>200

In [13]:
dataframe[condicion_columna ] # ventas1 con zona A tiene 120 y se va la fila

         zonaA  zonaB  zonaC
ventas2    210    450    250
ventas3    310    210    140

In [14]:
condicion_columna_mas = (dataframe['zonaA']>200) & (dataframe['zonaB']>300) # | or

In [15]:
dataframe[condicion_columna_mas]

         zonaA  zonaB  zonaC
ventas2    210    450    250

In [16]:
dataframe[condicion_columna_mas][['zonaA','zonaC']]

         zonaA  zonaC
ventas2    210    250

# Modificaci贸n de los nombres de las filas

In [17]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [18]:
nuevas_filas = 'dia1 dia2 dia3'.split()
nuevas_filas

['dia1', 'dia2', 'dia3']

In [19]:
dataframe['dias'] = nuevas_filas
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    120    340    250  dia1
ventas2    210    450    250  dia2
ventas3    310    210    140  dia3

In [22]:
#cambia el indice a la columna dias 
dataframe.set_index('dias')

      zonaA  zonaB  zonaC
dias
dia1    120    340    250
dia2    210    450    250
dia3    310    210    140

In [23]:
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    120    340    250  dia1
ventas2    210    450    250  dia2
ventas3    310    210    140  dia3

In [24]:
#cambia el indice a la columna dias 
dataframe=dataframe.set_index('dias')

In [25]:
dataframe

      zonaA  zonaB  zonaC
dias
dia1    120    340    250
dia2    210    450    250
dia3    310    210    140